app/views/admins/show.html.erb

			report id = <%= r.id %></br>
			Manager : <%= Manager.find(r.manager_id).name %> is waiting for his market to be approved <%= Market.find(r.market_id).group %> in <%= Market.find(r.market_id).address %></br>
---
SELECT  "managers".* FROM "managers" WHERE "managers"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT 1  [["id", 1]]