app/views/smart_shopping/corefunction.html.erb


<h3><%= Product.find(r.product_id).name %>&nbsp <%= Product.find(r.product_id).label %>&nbsp<%= Product.find(r.product_id).package %>&nbsp <%= Market.find(r.market_id).group %>&nbsp<%= Market.find(r.market_id).address %>&nbsp<%= r.price %></h3></br>
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT markets.*, (69.09332411348201 * ABS(markets.latitude - 41.8552904) * 0.7071067811865475) + (59.836573914187355 * ABS(markets.longitude - 12.4827564) * 0.7071067811865475) AS distance, CASE WHEN (markets.latitude >= 41.8552904 AND markets.longitude >= 12.4827564) THEN  45.0 WHEN (markets.latitude <  41.8552904 AND markets.longitude >= 12.4827564) THEN 135.0 WHEN (markets.latitude <  41.8552904 AND markets.longitude <  12.4827564) THEN 225.0 WHEN (markets.latitude >= 41.8552904 AND markets.longitude <  12.4827564) THEN 315.0 END AS bearing FROM "markets" WHERE (markets.latitude BETWEEN 41.811870865066744 AND 41.89870993493326 AND markets.longitude BETWEEN 12.4244620346269 AND 12.541050765373098)  ORDER BY distance ASC