app/views/managers/show.html.erb

SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT 1  [["id", 13]]
---
	<%else%>
		<% if (Market.find(current_manager.market_id)).status == false %>