app/controllers/admins_controller.rb

	  def show

	  @creationreports = Creationreport.all
---
SELECT "creationreports".* FROM "creationreports"