app/controllers/creationreports_controller.rb

  def confirm

  @creationreport = Creationreport.find(params[:session][:id])

	  if(@creationreport.nil?)
		flash[:danger] = "someone has already approved this market"
		redirect_to current_admin
	  else
	 	@market = Market.find(@creationreport.market_id)
		@market.update_attribute(:status, true)
		@manager = Manager.find(@creationreport.manager_id)
		@manager.update_attribute(:market_id, @market.id)
		@market.update_attribute(:status, true)
		Creationreport.destroy(@creationreport.id)
---
SELECT  "creationreports".* FROM "creationreports" WHERE "creationreports"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "markets" SET "status" = ?, "updated_at" = ? WHERE "markets"."id" = ?  [["status", "t"], ["updated_at", "2018-01-17 16:25:19.042058"], ["id", 1]]
SELECT  "managers".* FROM "managers" WHERE "managers"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "managers" SET "market_id" = ?, "updated_at" = ? WHERE "managers"."id" = ?  [["market_id", 1], ["updated_at", "2018-01-17 16:25:19.044462"], ["id", 1]]
DELETE FROM "creationreports" WHERE "creationreports"."id" = ?  [["id", 1]]

  def deny

 @creationreport = Creationreport.find(params[:session][:id])

	  if(@creationreport.nil?)
		flash[:danger] = "someone has already denied this market"
		redirect_to current_admin
	  else
		@market = Market.find(@creationreport.market_id)
		@market.update_attribute(:status, false)
		@manager = Manager.find(@creationreport.manager_id)
		@manager.update_attribute(:market_id, @market.id)
		Creationreport.destroy(@creationreport.id)
---
SELECT  "creationreports".* FROM "creationreports" WHERE "creationreports"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "markets" SET "status" = ?, "updated_at" = ? WHERE "markets"."id" = ?  [["status", "f"], ["updated_at", "2018-01-17 16:25:18.822960"], ["id", 1]]
SELECT  "managers".* FROM "managers" WHERE "managers"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "managers" SET "market_id" = ?, "updated_at" = ? WHERE "managers"."id" = ?  [["market_id", 1], ["updated_at", "2018-01-17 16:25:18.826206"], ["id", 1]]
DELETE FROM "creationreports" WHERE "creationreports"."id" = ?  [["id", 1]]