app/controllers/managers_controller.rb

  def show
      if(!current_manager.market.nil?)
        @owner = Owner.new
        @products = Product.all
        @list_owners = current_manager.market.owners
        #drawing request_chart
        @hashgraph = hash_2_graph(Request.group(:product_id).count)
---
SELECT COUNT(*) AS count_all, product_id AS product_id FROM "requests" GROUP BY "requests"."product_id"