app/controllers/managers_controller.rb

  def create
    @manager = Manager.new(manager_params)
    if @manager.save #registrazione con successo
---
INSERT INTO "managers" ("name", "surname", "tel", "yearofbirth", "email", "curriculum", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @manager = Manager.find(params[:id])
---
SELECT  "managers".* FROM "managers" WHERE "managers"."id" = ? LIMIT 1  [["id", 1]]

  def addmarket
    @market=Market.find_by_manager_id(nil)
---
SELECT  "markets".* FROM "markets" WHERE "markets"."manager_id" IS NULL LIMIT 1

  def edit
    @manager = Manager.find(params[:id])
---
SELECT  "managers".* FROM "managers" WHERE "managers"."id" = ? LIMIT 1  [["id", 3]]

  def update
    @manager = Manager.find(params[:id])
    if @manager.update_attributes(manager_params)
---
SELECT  "managers".* FROM "managers" WHERE "managers"."id" = ? LIMIT 1  [["id", 16]]
UPDATE "managers" SET "curriculum" = ?, "password_digest" = ?, "updated_at" = ? WHERE "managers"."id" = ?  [["curriculum", "mario rossi il mejo"], ["password_digest", "$2a$10$AIVWfJiBGz28m2bIlqeiX.AoA8CTmMkOPPSFkOEKq5M77gZ/4roGi"], ["updated_at", "2017-09-13 23:06:37.069196"], ["id", 1]]