app/controllers/managers_controller.rb

  def show
      if(!current_manager.market.nil?)
        @owner = Owner.new
        @products = Product.all
---
SELECT "products".* FROM "products"