app/controllers/markets_controller.rb

SELECT  "creationreports".* FROM "creationreports" WHERE "creationreports"."manager_id" = ? LIMIT 1  [["manager_id", 1]]
---
  def new
    if (current_manager.market_id!=nil)
      Market.destroy(current_manager.market_id)
      current_manager.update_attribute(:market_id, nil)
      @market = Market.new
    elsif(!Creationreport.find_by(:manager_id => current_manager.id).nil?)

SELECT COUNT(*) FROM "microposts" WHERE "microposts"."market_id" = ?  [["market_id", 1]]
---
  def show
    @market = Market.find(params[:id])
    @microposts = @market.microposts.paginate(page: params[:page])

INSERT INTO "markets" ("group", "address", "info", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
DELETE FROM "markets" WHERE "markets"."id" = ?  [["id", 1]]
INSERT INTO "creationreports" ("market_id", "manager_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["market_id", 1], ["manager_id", 1], ["created_at", "2018-01-17 16:25:28.090518"], ["updated_at", "2018-01-17 16:25:28.090518"]]
---
  def create

    @market = Market.new(market_params)

    if (@market.save)

	if(@market.latitude.nil?)
	flash[:danger] = t("your address does not exist")
	Market.destroy(@market.id)
	redirect_to new_market_path

        else
        Creationreport.create(:market_id => @market.id, :manager_id => current_manager.id)