app/controllers/markets_controller.rb

SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."market_id" = ?  ORDER BY "microposts"."created_at" DESC LIMIT 30 OFFSET 0  [["market_id", 1]]
---
  def show
    @market = Market.find(params[:id])
    @microposts = @market.microposts.paginate(page: params[:page])

INSERT INTO "markets" ("group", "address", "info", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create

    @market = Market.new(market_params)

    if (@market.save)