app/controllers/microposts_controller.rb

  def new

    @market = Market.find(params[:marketid])
---
SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT 1  [["id", 1]]

  def create

    @micropost = Micropost.new(micropost_params)

    if @micropost.save
---
INSERT INTO "microposts" ("content", "vote", "user_id", "market_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "this is a test"], ["vote", 5], ["user_id", 1], ["market_id", 1], ["created_at", "2018-01-17 16:25:26.511596"], ["updated_at", "2018-01-17 16:25:26.511596"]]