app/controllers/owners_controller.rb

INSERT INTO "owners" ("product_id", "market_id", "price", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["product_id", 2], ["market_id", 13], ["price", 4], ["stock", 20], ["created_at", "2017-09-13 15:01:17.096174"], ["updated_at", "2017-09-13 15:01:17.096174"]]
---
def create

	@owner = Owner.create(owners_params)

DELETE FROM "owners" WHERE "owners"."id" = ?  [["id", 12]]
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT 1  [["id", 12]]
---
def destroy

Owner.find(params[:id]).destroy