app/controllers/requests_controller.rb

INSERT INTO "requests" ("product_id", "shopper_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 2], ["shopper_id", 1], ["created_at", "2017-07-25 20:25:56.336675"], ["updated_at", "2017-07-25 20:25:56.336675"]]
---
def create
   @request = Request.create(request_params)

DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 2]]
SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", 2]]
---
def destroy
    Request.find(params[:id]).destroy