app/controllers/sessionsa_controller.rb

  def create
  admin = Admin.find_by(email: params[:session][:email].downcase)
---
SELECT  "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT 1  [["email", "navarro@gmail.com"]]