app/controllers/sessionsm_controller.rb

  def create
    manager = Manager.find_by(email: params[:session][:email].downcase)
---
SELECT  "managers".* FROM "managers" WHERE "managers"."email" = ? LIMIT 1  [["email", "rossi@gmail.com"]]