app/controllers/smart_shopping_controller.rb

INSERT INTO "shoppers" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2017-07-25 20:25:52.812764"], ["updated_at", "2017-07-25 20:25:52.812764"]]
SELECT "products".* FROM "products"
---
  def makelist

	  if(!list_logged_in?)
	  @list = Shopper.create(:user_id => current_user.id)
	  log_list(@list)
	  else
	  @list = current_list
          end

	@products = Product.all