app/controllers/users_controller.rb

INSERT INTO "users" ("name", "surname", "address", "yearofbirth", "email", "password_digest", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
        @user = User.new(user_params)
    	if @user.save #registrazione con successo

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "flavio1@gmail.com"], ["password_digest", "$2a$10$NFrqWCFW6K.KhgYjTPNEke675I916fh1VXHK/yVeZMZfpTAU7tNsy"], ["updated_at", "2017-09-11 13:19:30.199229"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)