app/views/markets/show.html.erb

SELECT  1 AS one FROM "microposts" WHERE "microposts"."market_id" = ? LIMIT 1  [["market_id", 1]]
---
    <div class="col-md-8">
      <% if @market.microposts.any? %>